Revit 2027 API
InitialColor Properties
The InitialColor type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TemperatureValue |  The light color temperature value in Kelvins.
Top
See Also
Reference
InitialColor Class
Autodesk.Revit.DB.Lighting Namespace